// Source :https://www.acwing.com/problem/content/4277/
// Author : Eland Woo
// Date   : 2022.6

/********************************************************************************** 
4274. 后缀表达式

给定一个二叉表达式树，请你输出相应的后缀表达式，要求使用括号反映运算符的优先级。

输入格式：
第一行包含整数 N，表示节点数量。节点编号 1∼N。接下来 N 行，每行给出一个节点的信息（第 i 行对应第 i 个节点）
，格式为：data left_child right_child 其中，data 是一个不超过 10 个字符的字符串，left_child 和 right_child 
分别是该节点的左右子节点的编号。没有子节点（即 NULL），则用 −1 表示。

输出格式：
在一行中输出答案，表达式符号之间不得有空格。

数据范围：
1≤N≤20

输入样例1：
8
* 8 7
a -1 -1
* 4 1
+ 2 5
b -1 -1
d -1 -1
- -1 6
c -1 -1
输出样例1：
(((a)(b)+)((c)(-(d))*)*)

输入样例2：
8
2.35 -1 -1
* 6 1
- -1 4
% 7 8
+ 2 3
a -1 -1
str -1 -1
871 -1 -1
输出样例2：
(((a)(2.35)*)(-((str)(871)%))+)
**********************************************************************************/
